fonecmid-diplom/src/Documents/ВКМ_Отпуска/ВКМ_Отпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_Отпуска</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ДвиженияПоОтпускам</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикОтпусков</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонца</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазностьДат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_Отпуска/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ГрафикОтпусковПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаНачала) И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаКонца) Тогда
		Если Элемент.ТекущиеДанные.ДатаКонца > Элемент.ТекущиеДанные.ДатаНачала Тогда
			Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Сотрудник) Тогда
				ЗаполнениеРезультатаДат(Элемент.ТекущиеДанные.Сотрудник);	
			КонецЕсли;
		Иначе 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Дата окончания отпуска меньше даты начала'");
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Диаграмма(Команда)
	АдресДиаграммВХранилище = ПоместитьОтпускаВоВременноеХранилище(); 
	ПараметрыДиаграммы = Новый Структура("АдресДиаграммВХранилище", АдресДиаграммВХранилище);
	ОткрытьФорму("ОбщаяФорма.ФормаГанта",ПараметрыДиаграммы, ЭтаФорма);
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнениеРезультатаДат(Сотрудник) 
	НайденныеСтроки = Объект.ГрафикОтпусков.НайтиСтроки(Новый Структура("Сотрудник",Сотрудник));
	РазностьДат = 0; 
	Для Каждого Строка Из НайденныеСтроки Цикл
		РазностьДат = РазностьДат + Число(НачалоДня(Строка.ДатаКонца) -НачалоДня(Строка.ДатаНачала))/(60*60*24);
		Строка.РазностьДат = РазностьДат;
	КонецЦикла;
КонецФункции

&НаСервере
Функция ПоместитьОтпускаВоВременноеХранилище()
	Возврат ПоместитьВоВременноеХранилище(Объект.ГрафикОтпусков.Выгрузить( ,"Сотрудник,ДатаНачала,ДатаКонца"));
КонецФункции 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не РольДоступна("ВКМ_Отпуска") И Не РольДоступна("АдминистраторСистемы") Тогда
		Элементы.Диаграмма.Доступность = Ложь;	
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
